src/Reports/ЧисленностьРаботающихИЗабронированныхГражданЗапаса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ЧисленностьРаботающихИЗабронированныхГражданЗапаса</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараметрОтбора</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ВоинскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВоинскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтношениеКВоинскойОбязанности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскойОбязанности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтношениеКВоинскомуУчету</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскомуУчету</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияЗапаса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииЗапасаВоеннообязанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Звание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВоинскиеЗвания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состав</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоставыВоеннослужащих</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВУС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Годность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГодностьКВоеннойСлужбе</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Военкомат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Военкоматы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеМобпредписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКомандыПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗабронированОрганизацией</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаВоинскогоУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыВоинскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальныйУчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияДолжностиДляВоинскогоУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляВоинскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВоенногоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпецУчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВУС1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВУС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЗапаса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсобыеОтметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ГодностьКВоеннойСлужбе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ГодностьКВоеннойСлужбе</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Годен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГоденСОграничениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграниченноГоден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноНеГоден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГоден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ОтношениеКВоинскойОбязанности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ОтношениеКВоинскойОбязанности</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Военнообязанный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВоеннообязанный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Призывник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыЗанятостиВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЗанятостиВОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/ЧисленностьРаботающихИЗабронированныхГражданЗапаса/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
	////////////////////////////////////////////////////////////////////////////////
	// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
	
	// Добавляет строку в таблицу ТДанных
	Процедура ОписаниеСтрокиДанных(ТДанных, НомерСтрокиОтчета, ИмяСтрокиОтчета, Категории)
		
		Строка = ТДанных.Добавить();
		Строка.НомерСтрокиОтчета = НомерСтрокиОтчета;
		Строка.ИмяСтрокиОтчета = ИмяСтрокиОтчета;
		Строка.Категории = Категории;
		
	КонецПроцедуры
	
	
	////////////////////////////////////////////////////////////////////////////////
	// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
	
	// Выполняет запрос и формирует табличный документ-результат отчета
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	// Параметры:
	//	ДокументРезультат - табличный документ, формируемый отчетом,
	//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
	//
	Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки,РасшифровкаКолонки=0) Экспорт  //Аверсон 16.01.2022 КВВ СВФР-008601
		
		ОтборВоенкомат = ТипЗнч(ПараметрОтбора) = Тип("Структура");
		Если ОтборВоенкомат Тогда
			ОтборВоенкомат			= ПараметрОтбора.ФлажокНастройкиВоенкомат;
			ВидСравненияВоенкомат	= ПараметрОтбора.ПолеВидаСравненияВоенкомат;
			Военкомат				= ПараметрОтбора.ПолеНастройкиВоенкомат;
			Организация				= ПараметрОтбора.Организация;
			//О.Т. Аверсон 25.09.2018 № 2420
			ОтборПодразделение			= ПараметрОтбора.ФлажокНастройкиПодразделение;
			ВидСравненияПодразделение	= ПараметрОтбора.ПолеВидаСравненияПодразделение;
			Подразделение				= ПараметрОтбора.ПолеНастройкиПодразделение;
			//О.Т. Аверсон 25.09.2018 № 2420
		КонецЕсли;
		
		Запрос = Новый Запрос;
		
		УсловиеПоРегиструВоинскогоУчета = "&ДатаАктуальности,";
		
		Если ОтборВоенкомат Тогда
			
			Запрос.УстановитьПараметр("Военкомат", Военкомат);
			
			Если ВидСравненияВоенкомат = ВидСравнения.Равно Тогда
				ВидСравненияСтрокой = "=" 
			ИначеЕсли ВидСравненияВоенкомат = ВидСравнения.НеРавно Тогда
				ВидСравненияСтрокой = "<>"
			ИначеЕсли ВидСравненияВоенкомат = ВидСравнения.ВСписке Тогда
				ВидСравненияСтрокой = "В"
			ИначеЕсли ВидСравненияВоенкомат = ВидСравнения.НеВСписке Тогда
				ВидСравненияСтрокой = "НЕ В"
			КонецЕсли;
			
			УсловиеПоРегиструВоинскогоУчета =  УсловиеПоРегиструВоинскогоУчета + "Военкомат " + ВидСравненияСтрокой + " (&Военкомат)"
			
		КонецЕсли;
		
		//О.Т. Аверсон 25.09.2018 № 2420
		ВидСравненияСтрокой1 = "=";
		Если ОтборПодразделение Тогда
			
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
			
			Если ВидСравненияПодразделение = ВидСравнения.Равно Тогда
				ВидСравненияСтрокой1 = " = " 
			ИначеЕсли ВидСравненияПодразделение = ВидСравнения.НеРавно Тогда
				ВидСравненияСтрокой1 = " <> "
			ИначеЕсли ВидСравненияПодразделение = ВидСравнения.ВСписке Тогда
				ВидСравненияСтрокой1 = " В "
			ИначеЕсли ВидСравненияПодразделение = ВидСравнения.НеВСписке Тогда
				ВидСравненияСтрокой1 = " НЕ В "
				//Аверсон 09.01.2020 КВВ СВФР-005303 (	
			ИначеЕсли ВидСравненияПодразделение = ВидСравнения.ВИерархии Тогда
				ВидСравненияСтрокой1 = " В ИЕРАРХИИ"
			ИначеЕсли ВидСравненияПодразделение = ВидСравнения.НеВИерархии Тогда
				ВидСравненияСтрокой1 = " НЕ В ИЕРАРХИИ"
				//Аверсон 09.01.2020 КВВ СВФР-005303 )	
			КонецЕсли;
			
		КонецЕсли;
		
		//О.Т. Аверсон 25.09.2018 № 2420
		
		СписокОфицерскихЗваний	=	Новый СписокЗначений;
		СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.МладшийЛейтенант);
		СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Лейтенант);
		СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.СтаршийЛейтенант);
		СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Капитан);
		СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Майор);
		СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Подполковник);
		СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Полковник);
		СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.ГенералМайор);
		СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.ГенералЛейтенант);
		СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.ГенералПолковник);
		СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.ГенералАрмии);
		СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.МаршалРоссийскойФедерации);
		
		СписокЗванийПрапорщиков	=	Новый СписокЗначений;
		СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.Прапорщик);
		СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.СтаршийПрапорщик);
		СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.МладшийСержант);
		СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.Сержант);
		СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.СтаршийСержант);
		СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.Старшина);
		
		СписокСолдатскихЗваний	=	Новый СписокЗначений;
		СписокСолдатскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Рядовой);
		СписокСолдатскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Ефрейтор);
		
		СписокГодныеКСлужбе = Новый СписокЗначений;
		СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.Годен);
		СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.ГоденСОграничениями);
		СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.ВременноНеГоден);	
		
		Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
		Запрос.УстановитьПараметр("Организация",		Организация);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация",ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		Запрос.УстановитьПараметр("Офицеры",			СписокОфицерскихЗваний);
		Запрос.УстановитьПараметр("Прапорщики",			СписокЗванийПрапорщиков);
		Запрос.УстановитьПараметр("Солдаты",			СписокСолдатскихЗваний);
		Запрос.УстановитьПараметр("Военнообязанный",	Перечисления.ОтношениеКВоинскойОбязанности.Военнообязанный);
		Запрос.УстановитьПараметр("СписокГодныеКСлужбе",СписокГодныеКСлужбе);
		Запрос.УстановитьПараметр("До30лет",			ДобавитьМесяц(ДатаАктуальности, -12*30));
		Запрос.УстановитьПараметр("До35лет",			ДобавитьМесяц(ДатаАктуальности, -12*35));
		Запрос.УстановитьПараметр("До40лет",			ДобавитьМесяц(ДатаАктуальности, -12*40));
		Запрос.УстановитьПараметр("До45лет",			ДобавитьМесяц(ДатаАктуальности, -12*45));
		Запрос.УстановитьПараметр("До50лет",			ДобавитьМесяц(ДатаАктуальности, -12*50));
		Запрос.УстановитьПараметр("До55лет",			ДобавитьМесяц(ДатаАктуальности, -12*55)); //Аверсон 21.06.2019 КВВ СВФР-004469
		Запрос.УстановитьПараметр("Призывник",			Перечисления.ОтношениеКВоинскойОбязанности.Призывник);
		Запрос.УстановитьПараметр("Руководители",		Перечисления.КатегорииДолжностейДляВоинскогоУчета.Руководители);
		Запрос.УстановитьПараметр("Специалисты",		Перечисления.КатегорииДолжностейДляВоинскогоУчета.СпециалистыСХ);
		Запрос.УстановитьПараметр("ДругиеСлужащие",		Перечисления.КатегорииДолжностейДляВоинскогоУчета.ДругиеСлужащие);
		Запрос.УстановитьПараметр("Рабочие",			Перечисления.КатегорииДолжностейДляВоинскогоУчета.РабочиеСХ);
		Запрос.УстановитьПараметр("ПустаяКатегорияВоинскогоУчета", Перечисления.КатегорииДолжностейДляВоинскогоУчета.ПустаяСсылка());
		Запрос.УстановитьПараметр("ВнутреннееСовместительство", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
		//Аверсон 25.08.2020 ПНА СВФР-006460(
		Запрос.УстановитьПараметр("РабочиеРазныхРазрядов", Перечисления.КатегорииДолжностейДляВоинскогоУчета.РабочиеРазныхРазрядов);
		Запрос.УстановитьПараметр("Рабочие1_2Разрядов", Перечисления.КатегорииДолжностейДляВоинскогоУчета.Рабочие1_2Разрядов);
		Запрос.УстановитьПараметр("Рабочие3_4Разрядов", Перечисления.КатегорииДолжностейДляВоинскогоУчета.Рабочие3_4Разрядов);
		Запрос.УстановитьПараметр("Рабочие5РазрядаИВыше", Перечисления.КатегорииДолжностейДляВоинскогоУчета.Рабочие5РазрядаИВыше);
		//Аверсон 25.08.2020 ПНА )
		
		//ПСА 13-01-2021 СВФР-007043+++
		ЗапросРазрядЕТС = Новый Запрос();
		ЗапросРазрядЕТС.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
		ЗапросРазрядЕТС.УстановитьПараметр("Организация",		Организация);	
		ЗапросРазрядЕТС.УстановитьПараметр("ГоловнаяОрганизация",ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		
		ТекстЗапросаРазрядЕТС= "";                 
		
		//СВЭЙ 24.05.2024 КВВ СВФР-012926 (
		Если Организация.ИНН = "700103211" Тогда 
			ТекстЗапросаРазрядЕТС = "ВЫБРАТЬ
			|ИсторияИзмененияУровней.Сотрудник КАК Сотрудник,
			|ИсторияИзмененияУровней.ВременныйПереводКлимовичи КАК Временно,
			|ИсторияИзмененияУровней.Период КАК Период
			|ПОМЕСТИТЬ ВТУровни
			|ИЗ РегистрСведений.РаботникиОрганизаций КАК ИсторияИзмененияУровней
			|ГДЕ
			|ИсторияИзмененияУровней.Период <= &ДатаАктуальности     
			|;   
			|ВЫБРАТЬ    
			|ВТУровни.Сотрудник КАК Сотрудник,
			|МАКСИМУМ(ВТУровни.Период) КАК Период
			|ПОМЕСТИТЬ ВтМаксимальныеПериод
			|ИЗ ВТУровни КАК ВТУровни
			|СГРУППИРОВАТЬ ПО  
			|ВТУровни.Сотрудник
			|;   			
			|ВЫБРАТЬ 
			|ВЫБОР КОГДА
			|ВТУровни.Временно = ИСТИНА
			|ТОГДА 
			|ДОБАВИТЬКДАТЕ(ВТУровни.Период,ДЕНЬ,-1) 
			|ИНАЧЕ 
			|ВТУровни.Период
			|КОНЕЦ КАК ДатаД,
			|ВтМаксимальныеПериод.Сотрудник
			|ПОМЕСТИТЬ ВтТолькоДатыПоСотр
			|ИЗ ВтМаксимальныеПериод 
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТУровни
			|ПО ВТУровни.Период = ВтМаксимальныеПериод.Период
			|И ВТУровни.Сотрудник = ВтМаксимальныеПериод.Сотрудник  
			|ГДЕ ВТУровни.Временно = ИСТИНА
			|;
			|ВЫБРАТЬ
			|ВтТолькоДатыПоСотр.ДатаД КАК ДатаД,
			|ВтТолькоДатыПоСотр.Сотрудник КАК Сотрудник,      
			|МАКСИМУМ(РО.Период) КАК Период
			|ПОМЕСТИТЬ втМаксПериод
			|ИЗ ВтТолькоДатыПоСотр КАК ВтТолькоДатыПоСотр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РО
			|ПО ВтТолькоДатыПоСотр.Сотрудник = РО.Сотрудник
			|И ВтТолькоДатыПоСотр.ДатаД >= РО.Период
			|СГРУППИРОВАТЬ ПО
			|ВтТолькоДатыПоСотр.ДатаД,
			|ВтТолькоДатыПоСотр.Сотрудник
			|;";
		КонецЕсли;
		//СВЭЙ 24.05.2024 КВВ СВФР-012926 )
		
		ТекстЗапросаРазрядЕТС = ТекстЗапросаРазрядЕТС +
		"ВЫБРАТЬ
		|		РаботникиОрганизацииСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
		|		РаботникиОрганизацииСрезПоследних.РазрядЕТС КАК РазрядЕТС
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК РаботникиОрганизацииСрезПоследних
		|	
		|	ГДЕ
		|		ВЫБОР
		|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделениеЗавершения
		|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение 
		|		КОНЕЦ = &Организация 
		|		И
		|		ВЫБОР
		|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостоянияЗавершения
		|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостояния 
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)";
		Если ОтборПодразделение Тогда 
			ТекстЗапросаРазрядЕТС = ТекстЗапросаРазрядЕТС + "
			| И ВЫБОР
			|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения
			|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации
			|	КОНЕЦ"+ВидСравненияСтрокой1+"(&Подразделение)";
			ЗапросРазрядЕТС.УстановитьПараметр("Подразделение", Подразделение);			
		КонецЕсли;   
		
		//СВЭЙ 24.05.2024 КВВ СВФР-012926 (
		Если Организация.ИНН = "700103211" Тогда   
			ТекстЗапросаРазрядЕТС = ТекстЗапросаРазрядЕТС + " 
            |И РаботникиОрганизацииСрезПоследних.ВременныйПереводКлимовичи <> ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|втМаксПериод.Сотрудник.Физлицо,  
			|РО.РазрядЕТС
			|ИЗ втМаксПериод КАК втМаксПериод
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РО
			|ПО втМаксПериод.Сотрудник = РО.Сотрудник
			|И втМаксПериод.Период = РО.Период
			|	ГДЕ
			|		ВЫБОР
			|			КОГДА РО.ПериодЗавершения <= &ДатаАктуальности
			|				И РО.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РО.ОбособленноеПодразделениеЗавершения
			|			ИНАЧЕ РО.ОбособленноеПодразделение 
			|		КОНЕЦ = &Организация 
			|		И
			|		ВЫБОР
			|			КОГДА РО.ПериодЗавершения <= &ДатаАктуальности
			|				И РО.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РО.ПричинаИзмененияСостоянияЗавершения
			|			ИНАЧЕ РО.ПричинаИзмененияСостояния 
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)";
			
			Если ОтборПодразделение Тогда 
				ТекстЗапросаРазрядЕТС = ТекстЗапросаРазрядЕТС + "
				| И ВЫБОР
				|		КОГДА РО.ПериодЗавершения <= &ДатаАктуальности
				|				И РО.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|			ТОГДА РО.ПодразделениеОрганизацииЗавершения
				|		ИНАЧЕ РО.ПодразделениеОрганизации
				|	КОНЕЦ"+ВидСравненияСтрокой1+"(&Подразделение)";
			КонецЕсли;  
		КонецЕсли;
		//СВЭЙ 24.05.2024 КВВ СВФР-012926 )
		
		ЗапросРазрядЕТС.Текст = ТекстЗапросаРазрядЕТС;
		
		РезультатЗапроса = ЗапросРазрядЕТС.Выполнить();
		ТЗ_РазрядЕТС = Новый ТаблицаЗначений;
		ТЗ_РазрядЕТС.Колонки.Добавить("ФизЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		КвалификаторыСтроки = Новый КвалификаторыСтроки(3);
		ОписаниеСтроки = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
		ТЗ_РазрядЕТС.Колонки.Добавить("РазрядЕТС", ОписаниеСтроки);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТЗ_РазрядЕТС.Добавить();
			НоваяСтрока.ФизЛицо = Выборка.ФизЛицо;
			НоваяСтрока.РазрядЕТС = СокрЛП(Выборка.РазрядЕТС); 
		КонецЦикла;	
		Запрос.УстановитьПараметр("ТЗ_РазрядЕТС", ТЗ_РазрядЕТС);
		
		ТекстОсновногоЗапроса = "";
		
		//СВЭЙ 24.05.2024 КВВ СВФР-012926 (
		Если Организация.ИНН = "700103211" Тогда 
			ТекстОсновногоЗапроса = "ВЫБРАТЬ
			|ИсторияИзмененияУровней.Сотрудник КАК Сотрудник,
			|ИсторияИзмененияУровней.ВременныйПереводКлимовичи КАК Временно,
			|ИсторияИзмененияУровней.Период КАК Период
			|ПОМЕСТИТЬ ВТУровни
			|ИЗ РегистрСведений.РаботникиОрганизаций КАК ИсторияИзмененияУровней
			|ГДЕ
			|ИсторияИзмененияУровней.Период <= &ДатаАктуальности     
			|;   
			|ВЫБРАТЬ    
			|ВТУровни.Сотрудник КАК Сотрудник,
			|МАКСИМУМ(ВТУровни.Период) КАК Период
			|ПОМЕСТИТЬ ВтМаксимальныеПериод
			|ИЗ ВТУровни КАК ВТУровни
			|СГРУППИРОВАТЬ ПО  
			|ВТУровни.Сотрудник
			|;   			
			|ВЫБРАТЬ 
			|ВЫБОР КОГДА
			|ВТУровни.Временно = ИСТИНА
			|ТОГДА 
			|ДОБАВИТЬКДАТЕ(ВТУровни.Период,ДЕНЬ,-1) 
			|ИНАЧЕ 
			|ВТУровни.Период
			|КОНЕЦ КАК ДатаД,
			|ВтМаксимальныеПериод.Сотрудник
			|ПОМЕСТИТЬ ВтТолькоДатыПоСотр
			|ИЗ ВтМаксимальныеПериод 
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТУровни
			|ПО ВТУровни.Период = ВтМаксимальныеПериод.Период
			|И ВТУровни.Сотрудник = ВтМаксимальныеПериод.Сотрудник  
			|ГДЕ ВТУровни.Временно = ИСТИНА
			|;
			|ВЫБРАТЬ
			|ВтТолькоДатыПоСотр.ДатаД КАК ДатаД,
			|ВтТолькоДатыПоСотр.Сотрудник КАК Сотрудник,      
			|МАКСИМУМ(РО.Период) КАК Период
			|ПОМЕСТИТЬ втМаксПериод
			|ИЗ ВтТолькоДатыПоСотр КАК ВтТолькоДатыПоСотр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РО
			|ПО ВтТолькоДатыПоСотр.Сотрудник = РО.Сотрудник
			|И ВтТолькоДатыПоСотр.ДатаД >= РО.Период
			|СГРУППИРОВАТЬ ПО
			|ВтТолькоДатыПоСотр.ДатаД,
			|ВтТолькоДатыПоСотр.Сотрудник
			|;";
		КонецЕсли;
		//СВЭЙ 24.05.2024 КВВ СВФР-012926 )
		
		ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + 
		"Выбрать
		|	ТЗ.ФизЛицо КАК ФизЛицо,
		|	ТЗ.РазрядЕТС КАК РазрядЕТС             	
		|Поместить Вт_РазрядЕТС
		|Из &ТЗ_РазрядЕТС КАК ТЗ
		|;
		|
		//+++ПСА 13-01-2021 СВФР-007043
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//Аверсон 25.08.2020 ПНА СВФР-006460(
		//|	РаботникиОрганизации.Должность.КатегорияВоинскогоУчета КАК ДолжностьКатегория,
		|	Выбор Когда РаботникиОрганизации.Должность.КатегорияВоинскогоУчета =  &РабочиеРазныхРазрядов Тогда
		|    	Выбор Когда Вт_РазрядЕТС.РазрядЕТС = ""1"" Или Вт_РазрядЕТС.РазрядЕТС = ""2""
		|				Тогда &Рабочие1_2Разрядов
		|             Когда Вт_РазрядЕТС.РазрядЕТС = ""3"" Или Вт_РазрядЕТС.РазрядЕТС = ""4""
		|             	Тогда &Рабочие3_4Разрядов
		|             Когда Вт_РазрядЕТС.РазрядЕТС = ""5"" Или Вт_РазрядЕТС.РазрядЕТС = ""6""
		|             		Или Вт_РазрядЕТС.РазрядЕТС = ""7"" Или Вт_РазрядЕТС.РазрядЕТС = ""8""
		|             		Или Вт_РазрядЕТС.РазрядЕТС = ""9"" Или Вт_РазрядЕТС.РазрядЕТС = ""10""
		|             	Тогда &Рабочие5РазрядаИВыше
		|			  Иначе &РабочиеРазныхРазрядов
		|		Конец
		|	Иначе РаботникиОрганизации.Должность.КатегорияВоинскогоУчета
		|	Конец КАК ДолжностьКатегория,
		//Аверсон 25.08.2020 ПНА )
		//|	ВУ.КатегорияДолжностиДляВоинскогоУчета КАК ДолжностьКатегория,
		|	СУММА(1) КАК ВсегоРаботающих,";       
		
		//Аверсон 16.01.2022 КВВ СВФР-008601 (
		Если РасшифровкаКолонки <> 0 Тогда 
			ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + "
			|РаботникиОрганизации.Сотрудник КАК Сотрудник, 
			|РаботникиОрганизации.Должность КАК Должность,";
		КонецЕсли;
		ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + "	
		//Аверсон 16.01.2022 КВВ СВФР-008601 )
		//Аверсон 19.01.2022 КВВ СВФР-008601 ( (изменение в условии : дописано "И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья))" (
		|	СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ВсегоВЗапасе,
		|	СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ОфицеровВЗапасе,
		|	СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.Звание.ОбщевойсковоеЗвание В (&Прапорщики) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковВЗапасе,
		|	СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.Звание.ОбщевойсковоеЗвание В (&Солдаты) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК СолдатВЗапасе,
		|	СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И НЕ(ВУ.Годность В (&СписокГодныеКСлужбе)) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатОграниченноГодныхВЗапасе,
		|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ВсегоВЗапасеЗабронировано,
		|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ОфицеровЗабронировано,
		|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И НЕ(ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До30лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатДо30Забронировано,
		|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И НЕ(ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До35лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До30лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатОт31До35Забронировано,
		|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И НЕ(ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До40лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До35лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатОт36До40Забронировано,
		|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И НЕ(ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До45лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До40лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатОт41До45Забронировано,
		|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И НЕ(ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До50лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До45лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатОт46До50Забронировано,
		|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И НЕ(ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До55лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До50лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатОт51До55Забронировано, //Аверсон 21.06.2019 КВВ СВФР-004469
		|	СУММА(ВЫБОР КОГДА НЕ(ВУ.ЗабронированОрганизацией = &Организация) И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И НЕ(ВУ.НаличиеМобпредписания) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК НезабронированноБезМобпредписаний,
		|	СУММА(ВЫБОР КОГДА НЕ(ВУ.ЗабронированОрганизацией = &Организация) И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.НаличиеМобпредписания ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК НезабронированноСМобпредписанием,
		|	СУММА(ВЫБОР КОГДА НЕ(ВУ.ЗабронированОрганизацией = &Организация) И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.НаличиеМобпредписания И ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК НезабронированноОфицеровСМобпредписанием,
		|	СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Призывник И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК Призывников,
		|	//СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.НаличиеМобпредписания ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ВЗапасеСМобпредписанием,
		|	//СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья)) И ВУ.НаличиеМобпредписания И ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ВЗапасеСМобпредписаниемОфицеров
		//Аверсон 19.01.2022 КВВ СВФР-008601 ( (изменение в условии : дописано "И (НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья))" )
		
		//Аверсон ЕАЕ 17.01.2025 СВФР-014609
		//Климовичи
		|   СУММА(ВЫБОР КОГДА ВУ.НаличиеМобпредписания = Истина ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК МобПредписание
		//Аверсон СВФР-014609
		
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
		|					И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ДолжностьЗавершения
		|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.Должность 
		|		КОНЕЦ КАК Должность,";
		
		//Аверсон 16.01.2022 КВВ СВФР-008601 (
		Если РасшифровкаКолонки <> 0 Тогда 
			ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + "
			|РаботникиОрганизацииСрезПоследних.Сотрудник КАК Сотрудник, ";
		КонецЕсли;
		ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + "	
		//Аверсон 16.01.2022 КВВ СВФР-008601 )
		
		|		РаботникиОрганизацииСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
		//Аверсон 25.08.2020 ПНА СВФР-006460
		|		РаботникиОрганизацииСрезПоследних.РазрядЕТС КАК РазрядЕТС
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК РаботникиОрганизацииСрезПоследних
		|	
		|	ГДЕ
		|		ВЫБОР
		|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделениеЗавершения
		|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение 
		|		КОНЕЦ = &Организация  
		|		И
		|		ВЫБОР
		|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостоянияЗавершения
		|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостояния 
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)";
		Если ОтборПодразделение Тогда 
			ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + "
			| И ВЫБОР
			|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения
			|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации
			|	КОНЕЦ"+ВидСравненияСтрокой1+"(&Подразделение)";
		КонецЕсли;
		
		//СВЭЙ 24.05.2024 КВВ СВФР-012926 (
		Если Организация.ИНН = "700103211" Тогда   
			ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + " 
            |И РаботникиОрганизацииСрезПоследних.ВременныйПереводКлимовичи <> ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ 
			|РО.Должность,";
			Если РасшифровкаКолонки <> 0 Тогда 
			ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + "
			|РО.Сотрудник, ";
		КонецЕсли;
		ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + "
			|втМаксПериод.Сотрудник.Физлицо,  
			|РО.РазрядЕТС
			|ИЗ втМаксПериод КАК втМаксПериод
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РО
			|ПО втМаксПериод.Сотрудник = РО.Сотрудник
			|И втМаксПериод.Период = РО.Период
			|	ГДЕ
			|		ВЫБОР
			|			КОГДА РО.ПериодЗавершения <= &ДатаАктуальности
			|				И РО.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РО.ОбособленноеПодразделениеЗавершения
			|			ИНАЧЕ РО.ОбособленноеПодразделение 
			|		КОНЕЦ = &Организация  
			|		И
			|		ВЫБОР
			|			КОГДА РО.ПериодЗавершения <= &ДатаАктуальности
			|				И РО.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РО.ПричинаИзмененияСостоянияЗавершения
			|			ИНАЧЕ РО.ПричинаИзмененияСостояния 
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)";
			Если ОтборПодразделение Тогда 
				ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + "
				| И ВЫБОР
				|		КОГДА РО.ПериодЗавершения <= &ДатаАктуальности
				|				И РО.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|			ТОГДА РО.ПодразделениеОрганизацииЗавершения
				|		ИНАЧЕ РО.ПодразделениеОрганизации
				|	КОНЕЦ"+ВидСравненияСтрокой1+"(&Подразделение)";
			КонецЕсли;
		КонецЕсли;
        //СВЭЙ 24.05.2024 КВВ СВФР-012926 )
		
		ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + "
		|  ) КАК РаботникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(" + УсловиеПоРегиструВоинскогоУчета + ") КАК ВУ
		|		ПО РаботникиОрганизации.ФизЛицо = ВУ.Физлицо
		//ПСА 13-01-2021 СВФР-007043 +++	
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_РазрядЕТС КАК Вт_РазрядЕТС
		|		ПО РаботникиОрганизации.ФизЛицо = Вт_РазрядЕТС.Физлицо	
		//+++ПСА 13-01-2021 СВФР-007043	
		| 
		|ГДЕ
		|	РаботникиОрганизации.Должность.КатегорияВоинскогоУчета <> &ПустаяКатегорияВоинскогоУчета
		|
		|СГРУППИРОВАТЬ ПО";
		
		//Аверсон 16.01.2022 КВВ СВФР-008601 (
		Если РасшифровкаКолонки <> 0 Тогда 
			ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + "
			|РаботникиОрганизации.Сотрудник,
			|РаботникиОрганизации.Должность,";
		КонецЕсли;
		ТекстОсновногоЗапроса = ТекстОсновногоЗапроса + "	
		//Аверсон 16.01.2022 КВВ СВФР-008601 )
		
		//Аверсон 25.08.2020 ПНА СВФР-006460(
		//|	РаботникиОрганизации.Должность.КатегорияВоинскогоУчета
		|	Выбор Когда РаботникиОрганизации.Должность.КатегорияВоинскогоУчета =  &РабочиеРазныхРазрядов Тогда
		|    	Выбор Когда Вт_РазрядЕТС.РазрядЕТС = ""1"" Или Вт_РазрядЕТС.РазрядЕТС = ""2""
		|				Тогда &Рабочие1_2Разрядов
		|             Когда Вт_РазрядЕТС.РазрядЕТС = ""3"" Или Вт_РазрядЕТС.РазрядЕТС = ""4""
		|             	Тогда &Рабочие3_4Разрядов
		|             Когда Вт_РазрядЕТС.РазрядЕТС = ""5"" Или Вт_РазрядЕТС.РазрядЕТС = ""6""
		|             		Или Вт_РазрядЕТС.РазрядЕТС = ""7"" Или Вт_РазрядЕТС.РазрядЕТС = ""8""
		|             		Или Вт_РазрядЕТС.РазрядЕТС = ""9"" Или Вт_РазрядЕТС.РазрядЕТС = ""10""
		|             	Тогда &Рабочие5РазрядаИВыше
		|			  Иначе &РабочиеРазныхРазрядов
		|		Конец
		|	Иначе РаботникиОрганизации.Должность.КатегорияВоинскогоУчета
		|	Конец
		//Аверсон 25.08.2020 ПНА )
		|";
		//|	ВУ.КатегорияДолжностиДляВоинскогоУчета";
		
		Если РасшифровкаКолонки = 0 Тогда //Аверсон 16.01.2022 КВВ СВФР-008601
			ДокументРезультат.Очистить();
			Макет 			= ПолучитьМакет("Форма6");
			ОбластьШапка 	= Макет.ПолучитьОбласть("ШапкаФормы6");
			ОбластьШапка.Параметры.ГодОтчета			= "за " +Формат(ДатаАктуальности, "ДФ=гггг") + " год";
			ОбластьШапка.Параметры.НазваниеОрганизации 	= Организация.Наименование;
			ДокументРезультат.Присоединить(ОбластьШапка);
		КонецЕсли;
		
		ТДанных = Новый ТаблицаЗначений;
		ТДанных.Колонки.Добавить("НомерСтрокиОтчета", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(10));
		ТДанных.Колонки.Добавить("ИмяСтрокиОтчета", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(100));
		ТДанных.Колонки.Добавить("Категории");
		ОписаниеТипаЧисла = ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10,0);
		ТДанных.Колонки.Добавить("ВсегоРаботающих", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("ВсегоВЗапасе", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("ОфицеровВЗапасе", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("ПрапорщиковВЗапасе", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("СолдатВЗапасе", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("ПрапорщиковСолдатОграниченноГодныхВЗапасе", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("ВсегоВЗапасеЗабронировано", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("ОфицеровЗабронировано", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("ПрапорщиковСолдатДо30Забронировано", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("ПрапорщиковСолдатОт31До35Забронировано", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("ПрапорщиковСолдатОт36До40Забронировано", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("ПрапорщиковСолдатОт41До45Забронировано", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("ПрапорщиковСолдатОт46До50Забронировано", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("ПрапорщиковСолдатОт51До55Забронировано", ОписаниеТипаЧисла); //Аверсон 21.06.2019 КВВ СВФР-004469
		ТДанных.Колонки.Добавить("НезабронированноБезМобпредписаний", ОписаниеТипаЧисла);
		ТДанных.Колонки.Добавить("Призывников", ОписаниеТипаЧисла);
		//ТДанных.Колонки.Добавить("ВЗапасеСМобпредписанием", ОписаниеТипаЧисла);
		//ТДанных.Колонки.Добавить("ВЗапасеСМобпредписаниемОфицеров", ОписаниеТипаЧисла);
		
		//Аверсон ЕАЕ 17.01.2025 СВФР-014609
		//Климовичи
		Если Организация.ИНН = "700103211" Тогда
			ТДанных.Колонки.Добавить("МобПредписание", ОписаниеТипаЧисла);
		КонецЕсли;
		//Аверсон СВФР-014609
		
		Категории = Перечисления.КатегорииДолжностейДляВоинскогоУчета;
		// список всех категорий срециалистов
		СпВсеСпециалисты = Новый СписокЗначений;
		СпВсеСпециалисты.Добавить(Категории.ПрочиеСпециалисты);
		СпВсеСпециалисты.Добавить(Категории.СпециалистыСХ);
		СпВсеСпециалисты.Добавить(Категории.СпециалистыТорговлиИОбщепита);
		СпВсеСпециалисты.Добавить(Категории.СпециалистыНауки);
		СпВсеСпециалисты.Добавить(Категории.СпециалистыКультуры);
		СпВсеСпециалисты.Добавить(Категории.СпециалистыОбразования);
		СпВсеСпециалисты.Добавить(Категории.Врачи);
		СпВсеСпециалисты.Добавить(Категории.СреднийМедицинскийПерсонал);
		// Список специалистов здравохранения
		СпСпециалистыЗдравохранения = Новый СписокЗначений;
		СпСпециалистыЗдравохранения.Добавить(Категории.Врачи);
		СпСпециалистыЗдравохранения.Добавить(Категории.СреднийМедицинскийПерсонал);
		// Список всех категорий рабочих
		СпВсеРабочие = Новый СписокЗначений;
		СпВсеРабочие.Добавить(Категории.ПрочиеРабочие);
		СпВсеРабочие.Добавить(Категории.Рабочие1_2Разрядов);
		СпВсеРабочие.Добавить(Категории.Рабочие3_4Разрядов);
		СпВсеРабочие.Добавить(Категории.Рабочие5РазрядаИВыше);
		СпВсеРабочие.Добавить(Категории.РабочиеНеИмеющиеТарифныхСтавок);
		СпВсеРабочие.Добавить(Категории.РабочиеСХ);
		СпВсеРабочие.Добавить(Категории.РабочиеЛокомотивныхБригад);
		СпВсеРабочие.Добавить(Категории.Водители);
		СпВсеРабочие.Добавить(Категории.Трактористы);
		
		ОписаниеСтрокиДанных(ТДанных, "1", 	"Руководители", 						Категории.Руководители);
		ОписаниеСтрокиДанных(ТДанных, "2", 	"Специалисты - всего", 					СпВсеСпециалисты);
		ОписаниеСтрокиДанных(ТДанных, "", 	"из них:", 								Неопределено);
		ОписаниеСтрокиДанных(ТДанных, "3", 	" - сельского хозяйства",				Категории.СпециалистыСХ);
		ОписаниеСтрокиДанных(ТДанных, "4", 	" - торговли и общественного питания", 	Категории.СпециалистыТорговлиИОбщепита);
		ОписаниеСтрокиДанных(ТДанных, "5", 	" - науки", 							Категории.СпециалистыНауки);
		ОписаниеСтрокиДанных(ТДанных, "6", 	" - культуры и искусства", 				Категории.СпециалистыКультуры);
		ОписаниеСтрокиДанных(ТДанных, "7", 	" - народного образования", 						Категории.СпециалистыОбразования);
		ОписаниеСтрокиДанных(ТДанных, "8", 	" - здравохранения - всего", 			СпСпециалистыЗдравохранения);
		ОписаниеСтрокиДанных(ТДанных, "", 	"в том числе:", 						Неопределено);
		ОписаниеСтрокиДанных(ТДанных, "9", 	" - врачи", 							Категории.Врачи);
		ОписаниеСтрокиДанных(ТДанных, "10",	" - средний медицинский персонал", 		Категории.СреднийМедицинскийПерсонал);
		ОписаниеСтрокиДанных(ТДанных, "11",	"Другие служащие", 						Категории.ДругиеСлужащие);
		ОписаниеСтрокиДанных(ТДанных, "12",	"Рабочие всего", 						СпВсеРабочие);
		ОписаниеСтрокиДанных(ТДанных, "  ",	"в том числе:", 						Неопределено);
		ОписаниеСтрокиДанных(ТДанных, "13",	" - 1-2 разрядов", 						Категории.Рабочие1_2Разрядов);
		ОписаниеСтрокиДанных(ТДанных, "14",	" - 3-4 разрядов", 						Категории.Рабочие3_4Разрядов);
		ОписаниеСтрокиДанных(ТДанных, "15",	" - 5-го разряда и выше", 				Категории.Рабочие5РазрядаИВыше);
		ОписаниеСтрокиДанных(ТДанных, "16",	" - не имеющие тарифных разрядов",		Категории.РабочиеНеИмеющиеТарифныхСтавок);
		ОписаниеСтрокиДанных(ТДанных, "17",	" - сельскохозяйственного производства",Категории.РабочиеСХ);
		ОписаниеСтрокиДанных(ТДанных, "18",	" - локомотивных бригад", 				Категории.РабочиеЛокомотивныхБригад);
		ОписаниеСтрокиДанных(ТДанных, "19",	" - водители", 							Категории.Водители);
		ОписаниеСтрокиДанных(ТДанных, "20",	" - трактористы",						Категории.Трактористы);
		ОписаниеСтрокиДанных(ТДанных, "  ",	"Из численности руководителей,",		Неопределено);
		ОписаниеСтрокиДанных(ТДанных, "  ",	"специалистов и рабочих:",				Неопределено);
		ОписаниеСтрокиДанных(ТДанных, "21",	" - летно-подъемный состав",			Неопределено);
		ОписаниеСтрокиДанных(ТДанных, "22",	" - плавающий состав",					Неопределено);
		ОписаниеСтрокиДанных(ТДанных, "23",	"Учащиеся",								Категории.Учащиеся);
		ОписаниеСтрокиДанных(ТДанных, "24",	"ИТОГО (сумма строк 1+2+11+12+23)", 	"ИТОГО");
		ОписаниеСтрокиДанных(ТДанных, "25",	"По небронируемым организациям",		Неопределено);
		ОписаниеСтрокиДанных(ТДанных, "26",	"ВСЕГО (сумма строк 24+25)", 			"ИТОГО");
		
		// Выполним запрос
		
		//Аверсон 19.01.2022 КВВ СВФР-008601 (
		Если РасшифровкаКолонки = 99 Тогда 
			ТекстОсновногоЗапроса = СтрЗаменить(ТекстОсновногоЗапроса,"(НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) И НЕ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья))","(ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоВозрасту) ИЛИ ВУ.ОтношениеКВоинскомуУчету = ЗНАЧЕНИЕ(Перечисление.ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья))");  
		КонецЕсли;
		//Аверсон 19.01.2022 КВВ СВФР-008601 )
		
		Запрос.Текст = ТекстОсновногоЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		Если РасшифровкаКолонки = 0 Тогда //Аверсон 16.01.2022 КВВ СВФР-008601
			Выборка = РезультатЗапроса.Выбрать();
			
			// подсчитаем значения показателей для каждой строки отчета
			Пока Выборка.Следующий() Цикл
				
				//Аверсон 25.08.2020 ПНА СВФР-006460(
				Если Выборка.ДолжностьКатегория = Перечисления.КатегорииДолжностейДляВоинскогоУчета.РабочиеРазныхРазрядов Тогда
					Сообщить("Не удалось определить категорию по разряду " + Выборка.ВсегоРаботающих + " сотрудников.");
					Продолжить;
				КонецЕсли;
				//Аверсон 25.08.2020 ПНА )
				
				Для каждого Строка Из ТДанных Цикл
					//фильтр на принадлежность категории строке 
					Если Строка.Категории = "ИТОГО" Тогда
						//в итоговую строку должны войти все категории 
					ИначеЕсли Строка.Категории = Неопределено Тогда
						Продолжить;
					ИначеЕсли ТипЗнч(Строка.Категории) = Тип("СписокЗначений") Тогда
						Если Строка.Категории.НайтиПоЗначению(Выборка.ДолжностьКатегория) = Неопределено Тогда
							Продолжить;
						КонецЕсли;	
					ИначеЕсли  Выборка.ДолжностьКатегория <> Строка.Категории Тогда
						Продолжить;
					КонецЕсли; 		
					
					// подсчет показателей строки
					Для К =3 По ТДанных.Колонки.Количество()-1 Цикл // начинаем с колонки "ВсегоРаботающих"
						ИмяКолонки = ТДанных.Колонки[К].Имя;
						Строка[ИмяКолонки] = Строка[ИмяКолонки] + Выборка[ИмяКолонки];
					КонецЦикла; 
				КонецЦикла; 
				
			КонецЦикла; 
			
			// Вывод данных
			ОбластьСтрока 	= Макет.ПолучитьОбласть("СтрокаФормы6");
			Для каждого Строка Из ТДанных Цикл
				ОбластьСтрока.Параметры.Заполнить(Строка);
				ДокументРезультат.Присоединить(ОбластьСтрока);
			КонецЦикла; 
			
			ЖирныйШрифт = Новый Шрифт(Макет.Область(1,1).Шрифт,,,Истина);
			ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы-2, 2, ДокументРезультат.ВысотаТаблицы-2, ДокументРезультат.ШиринаТаблицы).Шрифт = ЖирныйШрифт;
			ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы-2, 2, ДокументРезультат.ВысотаТаблицы-2, ДокументРезультат.ШиринаТаблицы).Шрифт = ЖирныйШрифт;
			ОбластьПодвал = Макет.ПолучитьОбласть("ПодвалФормы6");
			Исполнитель	= "";
			СтруктураОтветственныхЛиц = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация,ДатаАктуальности,Исполнитель);
			ОбластьПодвал.Параметры.ДолжностьРуководителя = СтруктураОтветственныхЛиц.РуководительДолжность;
			ОбластьПодвал.Параметры.ФИОРуководителя		  = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(СтруктураОтветственныхЛиц.Руководитель);
			
			Если ТипЗнч(ОбластьПодвал)	=	Тип("ТабличныйДокумент")	тогда
				ДокументРезультат.Присоединить(ОбластьПодвал);
			КонецЕсли;
			
			//Параметры документа
			ДокументРезультат.Автомасштаб 			= Истина;
			ДокументРезультат.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
			ДокументРезультат.Защита              	= Ложь;
		Иначе //Расшифровка колонки
			//Аверсон 16.01.2022 КВВ СВФР-008601 (
			ТЗРезультатЗапроса = РезультатЗапроса.Выгрузить();
			ТЗРезультатЗапросаКатегории = РезультатЗапроса.Выгрузить();
			ТЗРезультатЗапроса.Сортировать("Сотрудник");
			ТЗРезультатЗапросаКатегории.Свернуть("ДолжностьКатегория");
			ТЗРезультатЗапросаКатегории.Сортировать("ДолжностьКатегория");
			ПолеТабличногоДокумента1 = Новый ТабличныйДокумент;
			ТД = Новый ТабличныйДокумент;
			Макет = ПолучитьМакет("РасшифровкаКолонки");
			
			ОбластьГлавная = Макет.ПолучитьОбласть("Шапка");
			ОбластьСтрока = Макет.ПолучитьОбласть("Данные");
			ОбластьКатегория = Макет.ПолучитьОбласть("Категория");
			ОбластьИтого = Макет.ПолучитьОбласть("Итого");
			НаимКолонки = "";
			Если РасшифровкаКолонки = 1 Тогда
				НаимКолонки = "Всего работающих";
			ИначеЕсли РасшифровкаКолонки = 2 Тогда
				НаимКолонки = "Из численности всего работающих - военнообязанных:" + Символы.ПС + "Всего";
			ИначеЕсли РасшифровкаКолонки = 3 Тогда
				НаимКолонки = "Из численности всего работающих - военнообязанных:" + Символы.ПС + "в том числе:" + Символы.ПС + "офицеров и генералов";
			ИначеЕсли РасшифровкаКолонки = 4 Тогда
				НаимКолонки = "Из численности всего работающих - военнообязанных:" + Символы.ПС + "в том числе:" + Символы.ПС + "прапорщиков, мичманов, сержантов и старшин";
			ИначеЕсли РасшифровкаКолонки = 5 Тогда
				НаимКолонки = "Из численности всего работающих - военнообязанных:" + Символы.ПС + "в том числе:" + Символы.ПС + "солдат и матросов";
			ИначеЕсли РасшифровкаКолонки = 6 Тогда
				НаимКолонки = "Из численности всего работающих - военнообязанных:" + Символы.ПС + "численность прапорщиков, мичманов, сержантов, старшин, солдат и матросов запаса, годных к нестроевой службе";
			ИначеЕсли РасшифровкаКолонки = 7 Тогда
				НаимКолонки = "Из численности военнообязанных - забронировано:" + Символы.ПС + "Всего";
			ИначеЕсли РасшифровкаКолонки = 8 Тогда
				НаимКолонки = "Из численности военнообязанных - забронировано:" + Символы.ПС + "в том числе:" + Символы.ПС + "офицеров и генералов";
			ИначеЕсли РасшифровкаКолонки = 9 Тогда
				НаимКолонки = "Из численности военнообязанных - забронировано:" + Символы.ПС + "в том числе:" + Символы.ПС + "прапорщиков, мичманов, сержантов, старшин, солдат и матросов в возрасте:" + Символы.ПС + "до 30 лет";
			ИначеЕсли РасшифровкаКолонки = 10 Тогда
				НаимКолонки = "Из численности военнообязанных - забронировано:" + Символы.ПС + "в том числе:" + Символы.ПС + "прапорщиков, мичманов, сержантов, старшин, солдат и матросов в возрасте:" + Символы.ПС + "от 31 до 35 лет";
			ИначеЕсли РасшифровкаКолонки = 11 Тогда
				НаимКолонки = "Из численности военнообязанных - забронировано:" + Символы.ПС + "в том числе:" + Символы.ПС + "прапорщиков, мичманов, сержантов, старшин, солдат и матросов в возрасте:" + Символы.ПС + "от 36 до 40 лет";
			ИначеЕсли РасшифровкаКолонки = 12 Тогда
				НаимКолонки = "Из численности военнообязанных - забронировано:" + Символы.ПС + "в том числе:" + Символы.ПС + "прапорщиков, мичманов, сержантов, старшин, солдат и матросов в возрасте:" + Символы.ПС + "от 41 до 45 лет";
			ИначеЕсли РасшифровкаКолонки = 13 Тогда
				НаимКолонки = "Из численности военнообязанных - забронировано:" + Символы.ПС + "в том числе:" + Символы.ПС + "прапорщиков, мичманов, сержантов, старшин, солдат и матросов в возрасте:" + Символы.ПС + "от 46 до 50 лет";
			ИначеЕсли РасшифровкаКолонки = 14 Тогда
				НаимКолонки = "Из численности военнообязанных - забронировано:" + Символы.ПС + "в том числе:" + Символы.ПС + "прапорщиков, мичманов, сержантов, старшин, солдат и матросов в возрасте:" + Символы.ПС + "от 51 до 55 лет";
			ИначеЕсли РасшифровкаКолонки = 15 Тогда
				НаимКолонки = "Численность незабронированных военнообязанных, не имеющих мобилизационных предписаний";
			ИначеЕсли РасшифровкаКолонки = 16 Тогда
				НаимКолонки = "Из численности всего работающих - призывников";
				//Аверсон 19.01.2022 КВВ СВФР-008601 (
			ИначеЕсли РасшифровкаКолонки = 99 Тогда 
				НаимКолонки = "Сняты по возрасту, здоровью (не попали в отчет)";
				//Аверсон 19.01.2022 КВВ СВФР-008601 )
			КонецЕсли;
			
			ОбластьГлавная.Параметры.НомерКолонки = ?(РасшифровкаКолонки=99,"","Расшифровка колонки " + СокрЛП(РасшифровкаКолонки));
			ОбластьГлавная.Параметры.НаименованиеКолонки = НаимКолонки;
			
			ТД.Вывести(ОбластьГлавная);
			
			ИтогПП = 0;
			Для Каждого СтрКат ИЗ ТЗРезультатЗапросаКатегории Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("ДолжностьКатегория", СтрКат.ДолжностьКатегория);
				СтрокиТЗРезультатЗапроса = ТЗРезультатЗапроса.НайтиСтроки(Отбор);
				ПП = 0;
				Для Каждого Стр ИЗ СтрокиТЗРезультатЗапроса Цикл
					Продолжать = Ложь;
					Если РасшифровкаКолонки = 1 И Стр.ВсегоРаботающих <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 2 И Стр.ВсегоВЗапасе <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 3 И Стр.ОфицеровВЗапасе <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 4 И Стр.ПрапорщиковВЗапасе <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 5 И Стр.СолдатВЗапасе <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 6 И Стр.ПрапорщиковСолдатОграниченноГодныхВЗапасе <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 7 И Стр.ВсегоВЗапасеЗабронировано <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 8 И Стр.ОфицеровЗабронировано <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 9 И Стр.ПрапорщиковСолдатДо30Забронировано <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 10 И Стр.ПрапорщиковСолдатОт31До35Забронировано <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 11 И Стр.ПрапорщиковСолдатОт36До40Забронировано <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 12 И Стр.ПрапорщиковСолдатОт41До45Забронировано <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 13 И Стр.ПрапорщиковСолдатОт46До50Забронировано <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 14 И Стр.ПрапорщиковСолдатОт51До55Забронировано <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 15 И Стр.НезабронированноБезМобпредписаний <> 0 Тогда
						Продолжать = Истина;
					ИначеЕсли РасшифровкаКолонки = 16 И Стр.Призывников <> 0 Тогда
						Продолжать = Истина;
						//Аверсон 19.01.2022 КВВ СВФР-008601 (
					ИначеЕсли РасшифровкаКолонки = 99 Тогда
						Если Стр.ВсегоВЗапасе <> 0 ИЛИ Стр.ОфицеровВЗапасе <> 0 ИЛИ Стр.ПрапорщиковВЗапасе <> 0 ИЛИ Стр.СолдатВЗапасе <> 0 
							ИЛИ Стр.ПрапорщиковСолдатОграниченноГодныхВЗапасе <> 0 ИЛИ Стр.ВсегоВЗапасеЗабронировано <> 0 ИЛИ Стр.ОфицеровЗабронировано <> 0 
							ИЛИ Стр.ПрапорщиковСолдатДо30Забронировано <> 0 ИЛИ Стр.ПрапорщиковСолдатОт31До35Забронировано <> 0 ИЛИ Стр.ПрапорщиковСолдатОт36До40Забронировано <> 0
							ИЛИ Стр.ПрапорщиковСолдатОт41До45Забронировано <> 0 ИЛИ Стр.ПрапорщиковСолдатОт46До50Забронировано <> 0 ИЛИ Стр.ПрапорщиковСолдатОт51До55Забронировано <> 0
							ИЛИ Стр.НезабронированноБезМобпредписаний <> 0 ИЛИ Стр.Призывников <> 0 Тогда
							Продолжать = Истина;
						КонецЕсли;
						//Аверсон 19.01.2022 КВВ СВФР-008601 )
					КонецЕсли;
					Если Продолжать Тогда
						ПП = ПП + 1;
						Если ПП = 1 Тогда
							ОбластьКатегория.Параметры.ДолжностьКатегория = Стр.ДолжностьКатегория;
							ТД.Вывести(ОбластьКатегория);
						КонецЕсли;
						ОбластьСтрока.Параметры.НомерПП = ПП;
						ОбластьСтрока.Параметры.Сотрудник = СокрЛП(Стр.Сотрудник);
						ОбластьСтрока.Параметры.ТН = СокрЛП(Стр.Сотрудник.Код);
						ОбластьСтрока.Параметры.Должность = Стр.Должность;
						//	ОбластьСтрока.Параметры.ДолжностьКатегория = Стр.ДолжностьКатегория;
						ТД.Вывести(ОбластьСтрока);
					КонецЕсли;
				КонецЦикла;
				ИтогПП = ИтогПП + ПП;
			КонецЦикла;
			ОбластьИтого.Параметры.Итого = ИтогПП;
			ТД.Вывести(ОбластьИтого);
			ПолеТабличногоДокумента1.Очистить();
			ПолеТабличногоДокумента1.Вывести(ТД);
			ПолеТабличногоДокумента1.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
			ПолеТабличногоДокумента1.ЧерноБелаяПечать = Истина;
			РаботаСДиалогами.НапечататьДокумент(ТД, 1, Ложь, ?(РасшифровкаКолонки=99,"Сняты по возрасту, здоровью (не попали в отчет)","Расшифровка колонки " + СокрЛП(РасшифровкаКолонки))); //Аверсон 19.01.2022 КВВ СВФР-008601
			//Аверсон 16.01.2022 КВВ СВФР-008601 )
		КонецЕсли;
	КонецПроцедуры
	
#КонецЕсли
